//Начнем с простого

//Структура данных, представляющая пассажиров. 
// - все пассажиры хранятся в массиве
// - каждый пассажир представляется объектом со свойствами name и paid
// - свойство name содержит имя в виде простой строки
// - а в свойстве paid хранится булевское значение, которое показывает, заплатил ли пассажир за билет.
var passengers = [  { name: "Jane Doloop", paid: true },
                    { name: "Dr. Evel", paid: true }, //Данные пассажирова (можете дополнить свои)
                    { name: "Sue Property", paid: false },
                    { name: "John Funcall", paid: true } ];